DataProcessors/LM_ИзменениеУроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>LM_ИзменениеУроков</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/LM_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>LM_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.LM_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.LM_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.LM_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеПедагогу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/LM_ИзменениеУроков/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура НайтиУроки(Команда)
	НайтиУрокиНаСервере();
КонецПроцедуры

Процедура НайтиУрокиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Уроки.Ссылка КАК Урок,
		|	Уроки.НомерСтроки КАК НомерСтроки,
		|	Уроки.СписатьОплату КАК СписатьОплату,
		|	Уроки.Явка КАК Явка,
		|	Уроки.Ученик КАК Ученик,
		|	Уроки.Абонемент КАК Абонемент,
		|	Уроки.Тариф КАК Тариф,
		|	Уроки.Скидка КАК Скидка,
		|	Уроки.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	ЛОЖЬ КАК ЯвкаИзменено,
		|	ЛОЖЬ КАК СписатьОплатуИзменено,
		|	ЛОЖЬ КАК УдалитьУченика,
		|	"""" КАК Описание,
		|	Уроки.Ссылка.ПредметОбучения КАК ПредметОбучения
		|ИЗ
		|	Документ.LM_Урок.Ученики КАК Уроки
		|ГДЕ
		|	Уроки.Ссылка.Проведен
		|	И Уроки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Уроки.Ученик В ИЕРАРХИИ(&Ученики)
		|	И Уроки.Ссылка.ПредметОбучения = &ПредметОбучения
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомерСтроки)
		|ПО
		|	Урок";
	
	Запрос.Параметры.Вставить("ДатаНачала",Период.ДатаНачала);
	Запрос.Параметры.Вставить("ДатаОкончания",Период.ДатаОкончания);
	
	Если Ученики.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Уроки.Ученик В ИЕРАРХИИ(&Ученики)","");
	Иначе 		
		Запрос.Параметры.Вставить("Ученики",Ученики);
	КонецЕсли;
	
	Если ПредметОбучения.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Уроки.Ссылка.ПредметОбучения = &ПредметОбучения","");
	Иначе 		
		Запрос.Параметры.Вставить("ПредметОбучения",ПредметОбучения);
	КонецЕсли;
	
	ПромДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(ПромДерево, "ДеревоУроков");
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоУроковСписатьОплатуПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДеревоУроков.ТекущиеДанные;
	
	Элементы.ДеревоУроков.ТекущиеДанные.СписатьОплатуИзменено = НЕ Элементы.ДеревоУроков.ТекущиеДанные.СписатьОплатуИзменено;
	
	Если ТекДанные.Ученик.Пустая() Тогда // Это вышестоящая группа
		ОбойтиДеревоНаСервере(ТекДанные.СписатьОплату, Неопределено, ТекДанные.Урок);
	КонецЕсли;
	
	ОбновитьВидимостьДерева();
	
КонецПроцедуры 

&НаКлиенте
Процедура ДеревоУроковЯвкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДеревоУроков.ТекущиеДанные;
	
	ТекДанные.ЯвкаИзменено = НЕ ТекДанные.ЯвкаИзменено;
	
	Если ТекДанные.Ученик.Пустая() Тогда // Это вышестоящая группа
		ОбойтиДеревоНаСервере(Неопределено, ТекДанные.Явка, ТекДанные.Урок);
	КонецЕсли;
	
	ОбновитьВидимостьДерева();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДерева()
	
	ЭлементыДерева = ДеревоУроков.ПолучитьЭлементы();
	Для каждого элемента из  ЭлементыДерева цикл
		Если элемента.ЯвкаИзменено или элемента.СписатьОплатуИзменено или элемента.Описание <> "" Тогда
			элементы.ДеревоУроков.Развернуть(элемента.ПолучитьИдентификатор(),Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Процедура ОбойтиДеревоНаСервере(СписатьОплату, Явка, Урок)
	
	Древо = РеквизитФормыВЗначение("ДеревоУроков");
	
	Отбор = Новый Структура("Урок",Урок);
	НайденныеСТроки = Древо.Строки.НайтиСтроки(Отбор);
	
	Для Каждого Стр Из НайденныеСТроки Цикл
		
		Для Каждого Стр2 из Стр.Строки Цикл
			
			Если СписатьОплату <> Неопределено ТОгда
				Стр2.СписатьОплату = СписатьОплату;
			КонецЕсли;
			
			Если Явка <> Неопределено ТОгда
				Стр2.Явка = Явка;
			КонецЕсли;
			
		КонецЦикла; 				
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Древо, "ДеревоУроков");
	
КонецПроцедуры



&НаКлиенте
Процедура Применить(Команда)
	ПрименитьИзменения();
	Элементы.ДеревоУроков.Обновить();
	ОбновитьВидимостьДерева();
КонецПроцедуры
Процедура ПрименитьИзменения()
	
	Древо = РеквизитФормыВЗначение("ДеревоУроков");
	
	Для Каждого Стр Из Древо.Строки Цикл // Верхний уровень Урок
		
		Изменено = Ложь;
		
		Для Каждого Стр2 из Стр.Строки Цикл // Строки учеников
			
			Если (Стр2.СписатьОплатуИзменено или Стр2.ЯвкаИзменено) и НЕ Изменено Тогда
				Об = Стр2.Урок.ПолучитьОбъект();				
			КонецЕсли;    			
			
			Если Стр2.СписатьОплатуИзменено Тогда
				Стр2.Описание = ИзменитьУрок(Стр2.Ученик, Об, Стр2.СписатьОплату, Неопределено);
				Стр2.СписатьОплатуИзменено = Ложь;
				Изменено = Истина;
			КонецЕсли;
			
			Если Стр2.ЯвкаИзменено Тогда
				Стр2.Описание = ИзменитьУрок(Стр2.Ученик, Об, Неопределено, Стр2.Явка);
				Стр2.ЯвкаИзменено = Ложь;
				Изменено = Истина;
			КонецЕсли;
						
		КонецЦикла;
		
		Если Изменено Тогда
			Попытка
				Об.Записать(РежимЗаписиДокумента.Запись);
				Стр.Описание = "Изменено " +ТекущаяДата();
			Исключение
				Сообщить("Не удалось записать " +Об.Ссылка+ " " +ОписаниеОшибки());
			КонецПопытки; 			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Древо, "ДеревоУроков");
	
КонецПроцедуры
Функция ИзменитьУрок(Ученик, ОбъектУрок, СписатьОплату, Явка)
	
	Для Каждого Стр из ОбъектУрок.Ученики Цикл
		
		Если Стр.Ученик = Ученик Тогда
			      			
			Если СписатьОплату <> Неопределено Тогда
				Стр.СписатьОплату = СписатьОплату;
			КонецЕсли;
			
			Если Явка <> Неопределено Тогда
				Стр.Явка = Явка;
			КонецЕсли;
			
			Возврат "Успешно изменено! " +?(СписатьОплату<>Неопределено,"СписатьОплату="+СписатьОплату+ " ","")
			+?(Явка<>Неопределено,"Явка="+Явка,"")+ " " +ТекущаяДата();
			
		КонецЕсли;		
		
	КонецЦикла;
		
	Возврат "";
	
КонецФункции




&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьСписатьОплату(Команда)
	ОбойтиДеревоНаСервере2(Истина, Неопределено);	
	ОбновитьВидимостьДерева();
КонецПроцедуры
Процедура ОбойтиДеревоНаСервере2(СписатьОплату, Явка)
	
	Древо = РеквизитФормыВЗначение("ДеревоУроков");
	
	Для Каждого Стр Из Древо.Строки Цикл
		
		//Если СписатьОплату <> Неопределено ТОгда
		//	Стр.СписатьОплату = СписатьОплату;
		//	Стр.СписатьОплатуИзменено = Истина;
		//КонецЕсли;
		//
		//Если Явка <> Неопределено ТОгда
		//	Стр.Явка = Явка;
		//	Стр.ЯвкаИзменено = Истина;
		//КонецЕсли;
		ЯвкаИзменено = Ложь;
		ОплатаИзменено = Ложь;
			
		Для Каждого Стр2 из Стр.Строки Цикл
			
			Если СписатьОплату <> Неопределено и Стр2.СписатьОплату <> СписатьОплату ТОгда
				Стр2.СписатьОплату = СписатьОплату;
				Стр2.СписатьОплатуИзменено = Истина;
				ОплатаИзменено = Истина;
			КонецЕсли;
			
			Если Явка <> Неопределено и Стр2.Явка <> Явка ТОгда
				Стр2.Явка = Явка;
				Стр2.ЯвкаИзменено = Истина;
				ЯвкаИзменено = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЯвкаИзменено Тогда
			Стр.ЯвкаИзменено = Истина;
			
			Если Явка <> Неопределено ТОгда
				Стр.Явка = Явка;
			КонецЕсли;

		КонецЕсли;
		Если ОплатаИзменено Тогда
			Стр.СписатьОплатуИзменено = Истина;
			
			Если СписатьОплату <> Неопределено ТОгда
				Стр.СписатьОплату = СписатьОплату;
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Древо, "ДеревоУроков");
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьСписатьОплату(Команда)
	ОбойтиДеревоНаСервере2(Ложь, Неопределено);	
	ОбновитьВидимостьДерева();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЯвки(Команда)
	ОбойтиДеревоНаСервере2(Неопределено, Истина);	
	ОбновитьВидимостьДерева();
КонецПроцедуры

&НаКлиенте
Процедура СнятьЯвки(Команда)
	ОбойтиДеревоНаСервере2(Неопределено, Ложь);	
	ОбновитьВидимостьДерева();
КонецПроцедуры
